In [9]:
# The code was removed by Watson Studio for sharing.

        date    name  value
0 2018-12-12  Kimble  93.28
1 2019-03-08  Alanna  10.51
2 2019-10-09     Jay  29.41
3 2019-07-28  Rustin  47.94
4 2019-03-23   Pedro  98.77

In [11]:
def func_date(df):
    return df.sort_values(['date'])

In [12]:
func_date(df)

         date         name  value
16 2018-11-23       Culver  68.38
15 2018-11-24        Xenia  43.61
0  2018-12-12       Kimble  93.28
10 2019-01-13     Kristine  26.09
24 2019-01-27   Christabel  73.09
13 2019-02-03     Claudine  26.28
8  2019-02-14        Graig  79.75
1  2019-03-08       Alanna  10.51
5  2019-03-21         Isac   5.21
4  2019-03-23        Pedro  98.77
14 2019-04-07      Honoria  93.40
6  2019-04-10        Gayla  40.03
20 2019-04-11      Jackson  53.92
17 2019-05-14       Paddie  99.52
23 2019-05-25         Jack  87.38
22 2019-06-18     Christie  83.61
3  2019-07-28       Rustin  47.94
19 2019-08-02        Tadio   4.40
18 2019-08-17         Livy  51.81
12 2019-08-21         Teri  22.17
2  2019-10-09          Jay  29.41
11 2019-10-10      Brenden  41.40
7  2019-10-16      Ransell  80.89
21 2019-10-19        Elise  35.62
9  2019-10-21  Jacquenetta  97.73

In [13]:
def func_name(df):
    return df.sort_values(['name'])

In [14]:
func_name(df)

         date         name  value
1  2019-03-08       Alanna  10.51
11 2019-10-10      Brenden  41.40
24 2019-01-27   Christabel  73.09
22 2019-06-18     Christie  83.61
13 2019-02-03     Claudine  26.28
16 2018-11-23       Culver  68.38
21 2019-10-19        Elise  35.62
6  2019-04-10        Gayla  40.03
8  2019-02-14        Graig  79.75
14 2019-04-07      Honoria  93.40
5  2019-03-21         Isac   5.21
23 2019-05-25         Jack  87.38
20 2019-04-11      Jackson  53.92
9  2019-10-21  Jacquenetta  97.73
2  2019-10-09          Jay  29.41
0  2018-12-12       Kimble  93.28
10 2019-01-13     Kristine  26.09
18 2019-08-17         Livy  51.81
17 2019-05-14       Paddie  99.52
4  2019-03-23        Pedro  98.77
7  2019-10-16      Ransell  80.89
3  2019-07-28       Rustin  47.94
19 2019-08-02        Tadio   4.40
12 2019-08-21         Teri  22.17
15 2018-11-24        Xenia  43.61

In [15]:
def func_valor(df):
    return df.sort_values(['value'])

In [16]:
func_valor(df)

         date         name  value
19 2019-08-02        Tadio   4.40
5  2019-03-21         Isac   5.21
1  2019-03-08       Alanna  10.51
12 2019-08-21         Teri  22.17
10 2019-01-13     Kristine  26.09
13 2019-02-03     Claudine  26.28
2  2019-10-09          Jay  29.41
21 2019-10-19        Elise  35.62
6  2019-04-10        Gayla  40.03
11 2019-10-10      Brenden  41.40
15 2018-11-24        Xenia  43.61
3  2019-07-28       Rustin  47.94
18 2019-08-17         Livy  51.81
20 2019-04-11      Jackson  53.92
16 2018-11-23       Culver  68.38
24 2019-01-27   Christabel  73.09
8  2019-02-14        Graig  79.75
7  2019-10-16      Ransell  80.89
22 2019-06-18     Christie  83.61
23 2019-05-25         Jack  87.38
0  2018-12-12       Kimble  93.28
14 2019-04-07      Honoria  93.40
9  2019-10-21  Jacquenetta  97.73
4  2019-03-23        Pedro  98.77
17 2019-05-14       Paddie  99.52

In [17]:

body = client_ec41e963272b46eb91190bf537ca65c2.get_object(Bucket='leozinho-donotdelete-pr-q4yucdzwn4vaet',Key='data.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

df_1 = pd.read_csv(body)
df_1.head()

       name
0       Rog
1  Robinett
2    Stacee
3    Rutter
4     Candi

In [18]:
def func_csv(df):
    df.drop_duplicates(subset=None, keep='first', inplace=False)
    return df.sort_values(['name'])

In [20]:
func_csv(df_1)

           name
73     Adrianne
74        Alene
46   Alessandro
20       Alfons
99      Anthony
75        Armin
51      Artemis
41        Berne
90        Bunni
35         Calv
4         Candi
92       Carlyn
67       Caspar
79     Christie
80       Cindie
29     Clarence
12     Clarisse
85         Codi
60  Constantino
84   Cristionna
97        Daffi
21        Daune
13        Druci
22    Ellswerth
34        Elora
62    Fanchette
89        Fanya
5        Farica
59        Gaile
6       Garrard
..          ...
82        Perle
57   Philippine
23       Portia
14      Rafaela
33    Reginauld
11        Reine
72      Reinold
47        Retha
30      Riobard
1      Robinett
0           Rog
58      Rozelle
3        Rutter
53       Shandy
25        Slade
49       Sorcha
2        Stacee
76       Steven
61         Sven
40       Tandie
71       Tanney
48        Tasha
18      Theresa
7         Venus
26        Verne
28        Vevay
52      Whitney
86      William
15        Wolfy
87        Zarah

[100 rows x 1 columns]

In [9]:
xis = input ("Digite o valor de X")
sol = input ("Digite a resposta da equação x^2+2x-20, quando x for " + str(xis) + " ")
xis = int(xis)*int(xis) + 2*int(xis) - 20
if str(xis) == sol:
    print ("Resposta correta")
    
else:
    print("Resposta Errada, a resposta correta é " + str(xis))

Digite o valor de X10
Digite a resposta da equação x^2+2x-20, quando x for 10 101
Resposta Errada, a resposta correta é 100

In [8]:
print("Dada a seguinte equação x^2+2x-20, digite o valor de suas duas raizes com somente uma casa decimal.")
xis1 = input ("Digite a primeira raiz")
xis2 = input ("Digite a segunda raiz")
if float(xis1)>float(xis2): 
    if float(xis1) == 3.5 and float(xis2) == -5.5:
        print ("Resposta correta")    
    else:
        print ("Resposta errada , as raizes corretas são 3.5 e -5.5")   
        
if float(xis2)>float(xis1):
    if  float(xis2) == 3.5 and float(xis1) == -5.5:
        print ("Resposta correta")   
    else:
        print ("Resposta errada, as raizes corretas são 3.5 e -5.5")

Dada a seguinte equação x^2+2x-20, digite o valor de suas duas raizes com somente uma casa decimal.
Digite a primeira raiz33
Digite a segunda raiz22
Resposta errada , as raizes corretas são 3.5 e -5.5